In [1]:
def my_sq(x):
    return x ** 2

def my_exp(x, n):
    return x ** n

In [2]:
my_sq(4)

16

In [3]:
my_exp(5,4)

625

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame({'a':[10,20,30],
                   'b':[20,30,40]})

In [6]:
df['a'].apply(my_sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [7]:
df['a'].apply(my_exp, n=2)

0    100
1    400
2    900
Name: a, dtype: int64

In [8]:
df['a'].apply(my_exp, n=3)

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [9]:
def ddd(x):
    print(x[0]*x[1])
    return x[0]*x[1]

In [10]:
ddd((2,3))

6

6

In [11]:
df.apply(ddd)

200
600

a    200
b    600
dtype: int64

In [12]:
df.apply(ddd,axis=1)

200
600
1200

0     200
1     600
2    1200
dtype: int64

In [13]:
def dddd(x):
    len_x = len(x)
    total = 1
    for i in range(len_x):
        total *= x[i]
    print(total)
    return total

In [14]:
df.apply(dddd)

6000
24000

a     6000
b    24000
dtype: int64

In [15]:
df_to = df.apply(dddd, axis=1)

200
600
1200

In [16]:
type(df_to)

pandas.core.series.Series

In [17]:
df_to.info()

<class 'pandas.core.series.Series'>
RangeIndex: 3 entries, 0 to 2
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      int64
dtypes: int64(1)
memory usage: 152.0 bytes

In [18]:
import seaborn as sns

In [19]:
titanic = sns.load_dataset('titanic')

In [20]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [21]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [22]:
def count_missing(vec):
    null_count = pd.isnull(vec).sum()
    return null_count

In [23]:
titanic.apply(count_missing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [24]:
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    return num / dem

In [25]:
titanic.apply(prop_missing)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [26]:
def prop_complete(vec):
    return 1 - prop_missing(vec)

In [27]:
titanic.apply(prop_complete)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [28]:
titanic['age'].shift(1)

0       NaN
1      22.0
2      38.0
3      26.0
4      35.0
       ...
886    39.0
887    27.0
888    19.0
889     NaN
890    26.0
Name: age, Length: 891, dtype: float64

In [29]:
titanic.age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64